INSERT INTO office (address, when_opened, materials_delivered, days_since_last_card, accepted_applications, given_cards) 
VALUES 
('ул. Ставропольская, д. 140, г. Краснодар', 'вчера', 'нет', 0, 0, 0),
('ул. им. Максима Горького, д. 128, г. Краснодар', 'давно', 'да', 3, 15, 3),
('ул. им. Дзержинского, д. 100, г. Краснодар', 'давно', 'да', 3, 9, 1),
('ул. Красноармейская, д. 126, г. Краснодар', 'давно', 'да', 0, 38, 23),
('х. Ленина, п/о. 37, г. Краснодар', 'давно', 'нет', 0, 14, 0),
('тер. Пашковский жилой массив, ул. Крылатая, д. 2, г. Краснодар', 'давно', 'да', 12, 19, 1),
('ул. Восточно-Кругликовская, д. 64/2, г. Краснодар', 'давно', 'да', 27, 19, 12),
('ул. Красных Партизан, д. 439, г. Краснодар', 'давно', 'да', 33, 84, 63),
('ул. Таманская, д. 153 к. 3, кв. 2, г. Краснодар', 'давно', 'да', 2, 15, 1),
('ул. им. Дзержинского, д. 165, г. Краснодар', 'давно', 'да', 0, 19, 0),
('ст-ца. Елизаветинская, ул. Широкая, д. 260, г. Краснодар', 'давно', 'да', 15, 29, 15),
('ул. им. Тургенева, д. 174, 1 этаж, г. Краснодар', 'вчера', 'нет', 0, 0, 0),
('ул. Уральская, д. 162, г. Краснодар', 'давно', 'да', 4, 21, 5),
('ул. Уральская, д. 79/1, г. Краснодар', 'вчера', 'нет', 0, 5, 0),
('ул. им. Селезнева, д. 197/5, г. Краснодар', 'давно', 'да', 7, 14, 3),
('ул. Уральская, д. 117, г. Краснодар', 'вчера', 'нет', 0, 0, 0),
('ул. Зиповская, д. 1, г. Краснодар', 'давно', 'да', 6, 32, 9),
('ул. им. 40-летия Победы, д. 20/1, г. Краснодар', 'давно', 'да', 4, 35, 15),
('ул. им. Атарбекова, д. 24, г. Краснодар', 'вчера', 'нет', 0, 6, 0),
('ул. им. Героя Аверкиева А.А., д. 8, г. Краснодар', 'давно', 'да', 6, 18, 6),
('ул. им. Героя Аверкиева А.А., д. 8/1 к. мая, кв. 268, г. Краснодар', 'давно', 'да', 0, 15, 5),
('ул. им. Тургенева, д. 106, г. Краснодар', 'давно', 'да', 2, 96, 20),
('ул. Красных Партизан, д. 117, г. Краснодар', 'вчера', 'нет', 0, 0, 0),
('ул. Северная, д. 389, г. Краснодар', 'давно', 'да', 0, 16, 0),
('ул. Уральская, д. 166/3, г. Краснодар', 'давно', 'да', 3, 43, 29),
('ул. Северная, д. 524, г. Краснодар', 'давно', 'да', 3, 13, 4),
('ул. им. Кирилла Россинского, д. 61/1, г. Краснодар', 'давно', 'да', 6, 19, 5),
('ул. Коммунаров, д. 258, г. Краснодар', 'давно', 'да', 16, 45, 30),
('ул. им. Дзержинского, д. 100, г. Краснодар', 'давно', 'да', 1, 19, 4),
('ул. Северная, д. 326, г. Краснодар', 'давно', 'да', 3, 20, 9),
('ул. им. 40-летия Победы, д. 34, г. Краснодар', 'вчера', 'нет', 0, 19, 0),
('ул. Красная, д. 176, г. Краснодар', 'давно', 'да', 76, 82, 72),
('ул. Уральская, д. 79/1, г. Краснодар', 'давно', 'да', 23, 32, 21),
('ул. Северная, д. 326, г. Краснодар', 'давно', 'да', 4, 19, 4),
('ул. Красная, д. 149, г. Краснодар', 'давно', 'да', 9, 10, 7),
('п. Березовый, ул. Целиноградская, д. 6/1, г. Краснодар', 'вчера', 'нет', 0, 13, 0),
('ул. им. Дзержинского, д. 100, г. Краснодар', 'вчера', 'нет', 0, 10, 0),
('ул. Российская, д. 418, г. Краснодар', 'давно', 'да', 6, 30, 14),
('ул. им. Володи Головатого, д. 313, г. Краснодар', 'давно', 'да', 6, 65, 12),
('ул. Красная, д. 145, г. Краснодар', 'давно', 'да', 3, 20, 4),
('ул. Красная, д. 154, г. Краснодар', 'вчера', 'нет', 0, 0, 0);

INSERT INTO task_type (type, title, priority, time_required, condition_1, condition_2, grade_required)
VALUES
(1, 'Выезд на точку для стимулирования выдач', 'Высокий', 4, 'Дата выдачи последней карты более 7 дней назад, при этом есть одобренные заявки', 'Дата выдачи последней карты более 14 дней назад', 'Только синьор'),
(2, 'Обучение агента', 'Средний', 2, 'Отношение кол-ва выданных карт к одобренным заявкам менее 50%, если выдано больше 0 карт', '-', 'Синьор или мидл'),
(3, 'Доставка карт и материалов', 'Низкий', 1.5, 'Точка подключена вчера', 'Карты и материалы не доставлялись', 'Все уровни');

INSERT INTO employee (name, default_address, grade)
VALUES
('Дерягин Никита Владимирович', 'Краснодар, Красная, д. 139', 'Синьор'),
('Петрошев Валерий Павлович', 'Краснодар, Красная, д. 139', 'Мидл'),
('Евдокимов Давид Тихонович', 'Краснодар, Красная, д. 139', 'Джун'),
('Андреев Гордий Данилович', 'Краснодар, В.Н. Мачуги, 41', 'Синьор'),
('Иванов Адам Федорович', 'Краснодар, В.Н. Мачуги, 41', 'Мидл'),
('Бобылёв Ипполит Альбертович', 'Краснодар, В.Н. Мачуги, 41', 'Джун'),
('Беляева Евгения Антоновна', 'Краснодар, Красных Партизан, 321', 'Мидл'),
('Николаев Азарий Платонович', 'Краснодар, Красных Партизан, 321', 'Джун');

